In [1]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
con = engine.connect()
engine = create_engine("mysql+pymysql://root:@localhost:3306/portfolio_development")
conpf = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3")
conlite = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3")
conlt = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3")
conmy = engine.connect()
engine = create_engine(
    "postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development"
)
conpg = engine.connect()

In [2]:
name = "TVI"

### MySQL Stock Database

In [3]:
sql = '''
DELETE FROM price
WHERE name = "%s"'''
sql = sql % name
print(sql)

DELETE FROM price
WHERE name = "TVI"

In [4]:
rp = con.execute(sql)
rp.rowcount

1711

In [5]:
sql = '''
DELETE FROM nameall
WHERE name = "%s"'''
sql = sql % name
print(sql)

DELETE FROM nameall
WHERE name = "TVI"

In [6]:
rp = con.execute(sql)
rp.rowcount

1

In [7]:
sql = '''
DELETE FROM stockname
WHERE name = "%s"'''
sql = sql % name
print(sql)

DELETE FROM stockname
WHERE name = "TVI"

In [8]:
rp = con.execute(sql)
rp.rowcount

1

### PostgreSQL PortPg Database

In [9]:
sql = """
SELECT * FROM yr_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

SELECT * FROM yr_profits
WHERE name = 'TVI'

In [10]:
df = pd.read_sql(sql, conpg)
df

,id,name,year,quarter,latest_amt,previous_amt,inc_amt,inc_pct,ticker_id
0,2493951,TVI,2017,2,20693,-11326,32019,282.703514,593
1,2493950,TVI,2017,3,54633,-24006,78639,327.580605,593
2,2493949,TVI,2017,4,32761,17203,15558,90.437714,593
3,2493948,TVI,2018,1,66388,32679,33709,103.151871,593
4,2493947,TVI,2018,2,56882,20693,36189,174.885227,593
5,2493946,TVI,2018,3,140894,54633,86261,157.891750,593
6,2493945,TVI,2018,4,112096,32761,79335,242.162938,593
7,2493944,TVI,2019,1,122697,66388,56309,84.820000,593
8,2493943,TVI,2019,2,171576,56882,114694,201.634964,593
9,2493942,TVI,2019,3,55553,140894,-85341,-60.571068,593
10,2493941,TVI,2019,4,113336,112096,1240,1.106195,593
11,2493940,TVI,2020,1,-130778,122697,-253475,-206.590000,593
12,2493939,TVI,2020,2,16234,171576,-155342,-90.538304,593
13,2493938,TVI,2020,3,31177,55553,-24376,-43.878818,593
14,2493937,TVI,2020,4,77901,113336,-35435,-31.265441,593
15,2493936,TVI,2021,1,415745,-130778,546523,417.900000,593
16,2493935,TVI,2021,2,379556,16234,363322,2238.031292,593
17,2493934,TVI,2021,3,503856,31177,472679,1516.110000,593
18,2493933,TVI,2021,4,472229,77901,394328,506.190000,593
19,2493932,TVI,2022,1,431310,415745,15565,3.740000,593
20,2493931,TVI,2022,2,343063,379556,-36493,-9.610000,593
21,2493930,TVI,2022,3,226860,503856,-276996,-54.980000,593
22,2493929,TVI,2022,4,206774,472229,-265455,-56.210000,593
23,2493928,TVI,2023,1,198132,431310,-233178,-54.060000,593

In [11]:
sql = """
DELETE FROM yr_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM yr_profits
WHERE name = 'TVI'

In [12]:
rp = conpg.execute(sql)
rp.rowcount

24

In [13]:
sql = """
DELETE FROM epss
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM epss
WHERE name = 'TVI'

In [14]:
rp = conpg.execute(sql)
rp.rowcount

31

In [15]:
sql = """
DELETE FROM consensus
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM consensus
WHERE name = 'TVI'

In [16]:
rp = conpg.execute(sql)
rp.rowcount

0

In [17]:
sql = """
DELETE FROM stocks
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM stocks
WHERE name = 'TVI'

In [18]:
rp = conpg.execute(sql)
rp.rowcount

1

In [19]:
sql = """
DELETE FROM charts
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM charts
WHERE name = 'TVI'

In [20]:
rp = conpg.execute(sql)
rp.rowcount

0

In [21]:
sql = """
DELETE FROM profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM profits
WHERE name = 'TVI'

In [22]:
rp = conpg.execute(sql)
rp.rowcount

0

In [23]:
sql = """
DELETE FROM tickers
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM tickers
WHERE name = 'TVI'

In [24]:
rp = conpg.execute(sql)
rp.rowcount

1

### SQLite PortMy Database

In [25]:
sql = """
DELETE FROM stocks
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM stocks
WHERE name = 'TVI'

In [26]:
rp = conmy.execute(sql)
rp.rowcount

1

In [27]:
sql = """
DELETE FROM tickers
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM tickers
WHERE name = 'TVI'

In [28]:
rp = conmy.execute(sql)
rp.rowcount

1

### SQLite PortLt Database

In [29]:
sql = """
DELETE FROM yr_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM yr_profits
WHERE name = 'TVI'

In [30]:
rp = conlt.execute(sql)
rp.rowcount

24

In [31]:
sql = """
DELETE FROM qt_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM qt_profits
WHERE name = 'TVI'

In [32]:
rp = conlt.execute(sql)
rp.rowcount

27

In [33]:
sql = """
DELETE FROM epss
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM epss
WHERE name = 'TVI'

In [34]:
rp = conlt.execute(sql)
rp.rowcount

31

In [35]:
sql = """
DELETE FROM stocks
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM stocks
WHERE name = 'TVI'

In [36]:
rp = conlt.execute(sql)
rp.rowcount

1

In [37]:
sql = """
DELETE FROM tickers
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM tickers
WHERE name = 'TVI'

In [38]:
rp = conlt.execute(sql)
rp.rowcount

1

### MySQL Portfolio Database

In [39]:
sql = """
SELECT * FROM stocks
WHERE name = '%s'
"""
sql = sql % name
df = pd.read_sql(sql, conpf)
df

Empty DataFrame
Columns: [id, name, category_id, website]
Index: []

### Delete from name-ttl.csv manually